# Teste 01

## 1 - Importe o arquivo alunos.csv e armazene seu conteúdo em um DataFrame Pandas.

In [3]:
import pandas as pd

urlAlunos = "https://raw.githubusercontent.com/alura-cursos/pandas-conhecendo-a-biblioteca/main/desafios/alunos.csv"

alunos = pd.read_csv(urlAlunos )

## 2 - Visualize as primeiras 7 linhas do DataFrame e as 5 últimas.

In [4]:
alunos.head(7)

    Nome  Idade  Notas  Aprovado
0    Ary     20    7.5      True
1    Ana     18    NaN     False
2  Cátia     27    2.5     False
3  Denis     18    5.0     False
4   Beto     21   10.0      True
5  Bruna     23    NaN     False
6   Dara     21    7.0      True

In [5]:
alunos.tail()

      Nome  Idade  Notas  Aprovado
13   Mirla     25    9.0      True
14   Paulo     37    NaN     False
15  Mylena     29    7.0      True
16   Lucas     33    NaN     False
17   Nadia     34    8.0      True

## 3. Confira a quantidade de linhas e colunas desse DataFrame.

In [7]:
alunos.shape

(18, 4)

## 4. Explore as colunas do DataFrame e analise os tipos dos dados presentes em cada coluna.

In [16]:
alunos.info()

alunos.columns

alunos.dtypes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Nome      18 non-null     object
 1   Idade     18 non-null     int64
 2   Notas     12 non-null     float64
 3   Aprovado  18 non-null     bool
dtypes: bool(1), float64(1), int64(1), object(1)
memory usage: 578.0+ bytes

Nome         object
Idade         int64
Notas       float64
Aprovado       bool
dtype: object

## Extra: Calcule algumas estatísticas descritivas básicas dos dados do DataFrame (média, desvio padrão, etc). Dica: pesquise pelo método describe.

In [13]:
alunos.describe()

           Idade      Notas
count  18.000000  12.000000
mean   25.500000   6.800000
std     6.070662   2.204953
min    18.000000   2.500000
25%    21.000000   5.450000
50%    24.500000   7.000000
75%    28.750000   8.250000
max    37.000000  10.000000